** Strata defined by sex

#+BEGIN_SRC R  :results output raw drawer  :exports both  :session *R* :cache yes  
# stratified analyses
sex_strata <- list(list(label="Sex",append = TRUE,variable="Sex",level="Female",id=x$prepared_data[sex==0,id]),
                   list(label="Sex",append = TRUE,variable="Sex",level="Male",id=x$prepared_data[sex==1,id]))
x$estimate$Sex <- NULL
x <- run_rtmle(x,learner = "learn_glmnet",time_horizon = tau,verbose=FALSE,subsets=sex_strata,keep_influence = TRUE)
summary(x,analysis ="Sex")
#+END_SRC

#+RESULTS:
:results:
subset       Target Protocol Target_parameter Time_horizon Estimator Reference  Estimate Standard_error Lower Upper P_value
   <char>       <char>   <char>           <char>        <num>    <fctr>    <char>     <num>          <num> <num> <num>   <num>
1:        Outcome_risk  Never_A  Risk_difference            2      tmle  Always_A 0.2769242             NA    NA    NA      NA
2:        Outcome_risk  Never_A       Risk_ratio            2      tmle  Always_A 2.5308787             NA    NA    NA      NA
   subset       Target Protocol Target_parameter Time_horizon Estimator  Estimate P_value Standard_error      Lower     Upper Estimate (CI_95)
   <char>       <fctr>   <fctr>           <fctr>        <num>    <fctr>     <num>   <num>          <num>      <num>     <num>           <char>
1:        Outcome_risk Always_A             Risk            2      tmle 0.1808923       1     0.08365928 0.01692313 0.3448615  18.1 [1.7;34.5]
2:        Outcome_risk  Never_A             Risk            2      tmle 0.4578165       1     0.09533059 0.27097199 0.6446610 45.8 [27.1;64.5]
3:        Outcome_risk  Never_A  Risk_difference            2      tmle 0.2769242      NA             NA         NA        NA     27.7 [NA;NA]
4:        Outcome_risk  Never_A       Risk_ratio            2      tmle 2.5308787      NA             NA         NA        NA      2.5 [NA;NA]
   Reference
      <char>
1:          
2:          
3:  Always_A
4:  Always_A
Sex       Target Protocol Target_parameter Time_horizon Estimator Reference  Estimate Standard_error      Lower      Upper    P_value
   <char>       <char>   <char>           <char>        <num>    <fctr>    <char>     <num>          <num>      <num>      <num>      <num>
1: Female Outcome_risk  Never_A  Risk_difference            2      tmle  Always_A 0.3544266      0.1415425 0.07700836  0.6318449 0.01227879
2: Female Outcome_risk  Never_A       Risk_ratio            2      tmle  Always_A 3.2159465      0.5788303 1.03420729 10.0002309 0.04358366
      Sex       Target Protocol Target_parameter Time_horizon Estimator Reference  Estimate Standard_error      Lower     Upper   P_value
   <char>       <char>   <char>           <char>        <num>    <fctr>    <char>     <num>          <num>      <num>     <num>     <num>
1:   Male Outcome_risk  Never_A  Risk_difference            2      tmle  Always_A 0.0667422      0.1248143 -0.1778894 0.3113738 0.5928352
2:   Male Outcome_risk  Never_A       Risk_ratio            2      tmle  Always_A 1.2771494      0.4571470  0.5213357 3.1287146 0.5925638
      Sex       Target Protocol Target_parameter Time_horizon Estimator  Estimate    P_value Standard_error       Lower      Upper
   <char>       <fctr>   <fctr>           <fctr>        <num>    <fctr>     <num>      <num>          <num>       <num>      <num>
1: Female Outcome_risk Always_A             Risk            2      tmle 0.1599437 1.00000000     0.08571434 -0.00805336  0.3279407
2: Female Outcome_risk  Never_A             Risk            2      tmle 0.5143703 1.00000000     0.11269172  0.29349856  0.7352420
3: Female Outcome_risk  Never_A  Risk_difference            2      tmle 0.3544266 0.01227879     0.14154252  0.07700836  0.6318449
4: Female Outcome_risk  Never_A       Risk_ratio            2      tmle 3.2159465 0.04358366     0.57883027  1.03420729 10.0002309
5:   Male Outcome_risk Always_A             Risk            2      tmle 0.2408167 1.00000000     0.09987795  0.04505952  0.4365739
6:   Male Outcome_risk  Never_A             Risk            2      tmle 0.3075589 1.00000000     0.11581949  0.08055688  0.5345609
7:   Male Outcome_risk  Never_A  Risk_difference            2      tmle 0.0667422 0.59283523     0.12481432 -0.17788936  0.3113738
8:   Male Outcome_risk  Never_A       Risk_ratio            2      tmle 1.2771494 0.59256381     0.45714703  0.52133567  3.1287146
   Estimate (CI_95) Reference
             <char>    <char>
1:  16.0 [0.0;32.8]          
2: 51.4 [29.3;73.5]          
3:  35.4 [7.7;63.2]  Always_A
4:   3.2 [1.0;10.0]  Always_A
5:  24.1 [4.5;43.7]          
6:  30.8 [8.1;53.5]          
7:   6.7 [0.0;31.1]  Always_A
8:    1.3 [0.5;3.1]  Always_A
:end:

